Cut diagrams to mermaid
